{
  "recipes": [
    {
      "title":  "Brioche",
      "prepMinutes":  1440,
      "cookMinutes":  35,
      "servings":  10,
      "ingredients": "0.5,Cup,whole milk\n2.5,tsp,dry yeast\n1,Tbsp,honey\n5,,Whole eggs at room temperature\n1,,Egg yolk at room temperature\n2,tsp,vanilla extract\n5,Tbsp,granulated sugar\n17.6,oz,AP Flour\n1.5,tsp,sea salt\n8.8,oz, butter at room temperature",
      "instructions": "Heat milk in the microwave until warm to the touch, approximately 20-30 seconds\nCombine warm milk, honey, and dry yeast in a small container and whisk until combined.  Allow to sit until ten minutes until frothy and aromatic\nIn the bowl of a stand mixer add whole eggs and egg yolk and whisk to break up egg yolks\nAdd vanilla extract and yeast mixture to egg mixture (after the wait specified in Step 2)\nAdd flour, sugar, and salt to wet ingredients and mix slowly until forming a “scraggy dough.”  The mixture should appear wet and roughly homogeneous at this point\nContinue mixing at speed 3 for 3-5 minutes.  This timing is not precise, but developing this dough is going to take quite some time\nDivide the butter into four roughly equivalent portions.  Repeat adding one portion and mixing at speed 3 until the butter is evenly incorporated into the dough, roughly 3 minutes.  Scrape down the bowl after each addition.  Cutting the butter into smaller portions will aid this process.\nAfter all butter is incorporated, mix on speed 6 until the pulls away from the sides of the bowl during mixing and is no longer sticky, approximately 15 minutes.  The dough should lift from the bowl as one piece, leaving minimal residue in the bowl.  Mix until reaching this consistency, as it may take more than 15 minutes and under-developing gluten here will produce a poor result\nTurn the dough onto a heavily floured surface and work into a ball\nPlace dough back in a large container that will allow it to grow significantly.  Store at room temperature and wait 60-90 minutes, until dough has at least doubled in size\nTurn the dough onto a heavily floured surface, pressing down lightly, and work into a ball\nPlace dough back into the large container.  Store chilled (in the refrigerator) overnight, up to 24 hours\nCoat a 9” x 5” loaf pan(s) in nonstick spray.  Lightly flour it, tapping off excess\nUsing a kitchen scale, divide the dough into two equal portions.  If only preparing one loaf at a time, return one half to chilled storage.  In my experience, each portion will be approximately 630 grams\nUsing a kitchen scale, further divide the dough into three equal portions (if making one loaf at a time) or six equal portions (if making both loaves simultaneously).  In my experience, each portion will be approximately 210 grams\nOn a well-floured surface work each portion into a roughly cylindrical tube of approximately 14” in length.  It is helpful to roll the dough into a rectangle and re-roll that rectangle into a tight spiral\nPinch the ends of three portions of dough into one point.  Plait (braid) the dough, alternating outer strands over center strand.  Pinch the loose ends together\nTuck ends of the dough under (they’re just not going to be pretty) and place the plaited dough into the prepared loaf pan\nAllow dough to rise in the pan at room temperature for approximately two hours.  Dough should slowly recover from being lightly pressed by a finger.  Ideally dough will now rest just below the top edge of the loaf pan\nCoat dough in egg wash and bake at 375 F until internal temperature reaches 193 F, approximately 35 minutes"
    },
    {
      "title": "Sour Cream and Chive Rolls",
      "prepMinutes": 180,
      "cookMinutes": 30,
      "servings": 24,
      "ingredients": "3/4,Cup,whole milk\n1/3,cup,bread flour\n1/2,tsp,dry yeast\n1,cup,sour cream\n1/4,cup,sugar\n4,tsp,kosher salt\n3,,eggs\n8,Tbsp,butter at room temperature\n1/2,cup,finely chopped chives",
      "instructions": "Combine 1/2 cup milk, 1/3 cup flour, and 1/2 cup water in small saucepan.  Mix/stir until smooth\nCook mixture over medium heat, stirring constantly, until a stiff paste forms (approximately 2 minutes).  Scrape into the bowl of the stand mixture\nAdd 2 Tbsp milk to saucepan and heat over low until warm to the touch\nRemove saucepan from heat, add yeast, whisk to combine, and allow yeast to develop, approximately 5 minutes\nAdd yeast mixture to the bowl of the stand mixer, along with remaining flour, sour cream, salt, 4 Tbsp butter, and 2 eggs\nMix on low speed until a scraggy dough forms.  Increase mixing speed to medium and continue until dough is smooth and pulls from the walls of the bowl, approximately 8-10 minutes\nForm dough into a ball and place into a large container.  Allow to rise until doubled in size, approximately 60-90 minutes\nUse 2 Tbsp of butter to coat the 13” x 9” pan.  This may appear to be too much.  It is not\nGently deflate the dough and roll into a roughly 12” x 12” square (though there is no need for precision here)\nSprinkle chives onto rolled dough\nRoll dough into a tube and work with hands to incorporate chives roughly evenly.  You may roll dough over any chives that have fallen out to bring them back into the mixture\nWeigh the dough mixture.  Separate one twenty-fourth of the dough (by weight) and roll into a rough sphere on an unfloured surface.  Place seam-side down into the buttered 13” x 9” pan\nAllow dough to rise again in the pan, approximately 45-60 minutes\nTowards the tail end of the second rise, preheat oven to 375 F \nUse the third egg to wash the exposed surfaces of the rolls\nBake rolls until golden brown, approximately 25-30 minutes\nNear the end of the bake, melt remaining 2 Tbsp butter in a small saucepan\nImmediately after pulling rolls from oven, brush with melted butter and top with flaky sea salt and freshly-cracked pepper"
    },
    {
      "title": "French Macarons",
      "prepMinutes": 105,
      "cookMinutes": 15,
      "servings": 24,
      "ingredients": "7,ounces,confectioners’ sugar\n4,ounces,finely-ground almond meal or flour\n4,,large egg whites at room temperature\n1/8,tsp,cream of tartar\n3 1/2,ounces,granulated sugar\n,,(Optional) Food coloring",
      "instructions": "Preheat oven to 300 F and place a rack in the lower section of the oven.  Line baking sheets with parchment paper or silicone mats.  Make sure the pans are flat (not dented or warped) and the parchment is trimmed to fit the pan. Using paper templates, trace circles onto the parchment or place them under the silicone mats\nSieve almond flour and confectioners’ sugar (repeatedly, if necessary).  Mixture should be very fine and uniform\nAdd egg whites, cream of tartar, and optional food coloring to the bowl of a stand mixer fitted with a whisk attachment.  Whip on medium speed until foamy\nGradually add granulated sugar, scraping down sides of the mixing bowl if necessary.  Whip until meringue reaches stiff, glossy peaks resembling shaving cream\nAdd one-third the flour mixture to the meringue and carefully fold using a spatula.  Once incorporated, add the remaining flour mixture, smearing the batter along the sides of the bowl and folding back to the center.  Repeat until the batter becomes shiny and holds a ribbon for several seconds.  If it falls in clumps and doesn’t flow slowly, continue to fold gently, deflating the batter until the proper consistency is reached.  Be careful not to overmix\nTransfer batter to a pastry bag fitted with a 1/2-inch plain round tip.  Pipe a small dollop of batter into the corners of each backing sheet and lay parchment ink side down, pressing to secure.  Using both hands to hold the pastry bag, pipe batter by placing the tip ½ inch above the parchment and fill.  Once the circle is filled, stop squeezing and make a quick upward and sideways motion to detach the batter and move on to the next circle (the batter should settle and smooth into a glossy round circle)\nRap (drop) the tray to remove any large bubbles from the piped meringues\nLet macarons stand at room temperature until a firm skin forms on the macarons, 30 to 45 minutes.  To check lightly touch the side – your finger should not make a dent\nBake macarons, one sheet at a time, rotating halfway through, until they are crisp and firm, approximately 14 to 16 minutes.  Carefully slide macaron topped parchment sheets onto a wire rack and allow macarons to cool completely before removing from paper and filling\nTo assemble macarons, pipe about 1 teaspoon of filling on to the flat side of a cooled macaron.  Place another cookie, flat side to flat side, and gentle press just enough to push the filling towards the edges\nMacarons can be refrigerated in an airtight container for up to three days"
    },
    {
      "title": "Chocolate Ganache",
      "prepMinutes": 60,
      "cookMinutes": 10,
      "servings": 8,
      "ingredients": "2/3,cup,heavy whipping cream\n8,oz,dark chocolate (chopped)\n2,tablespoons,unsalted butter (softened)\n1/8,teaspoon,kosher salt",
      "instructions": "Add heavy cream to a small saucepan over medium-high heat and bring to a simmer\nPlace chocolate in a heatproof bowl and pour hot cream over chocolate\nLet stand for 5 minutes\nSlowly stir the chocolate mixture with a silicone spatula to combine.  Add butter and and salt, whisk until smooth\nLet cool, stirring every 10 minutes until firm but still pliable\nWhen ganache reaches the desired consistency, transfer to a piping bag with a medium round tip"
    },
    {
      "title": "Honey and Cardamom Buttercream",
      "prepMinutes": 20,
      "cookMinutes": 10,
      "servings": 8,
      "ingredients": "2,,large egg whites (at room temperature)\n1/2,cup,granulated sugar\n2.sticks,unsalted butter (at room temperature)\n1/2,tsp,freshly ground cardamom\n3,Tbsp,honey\n1/8,tsp,fine kosher salt",
      "instructions": "Whisk egg whites and sugar in a small heatproof bowl\nPlace mixture over a saucepan with simmering water, whisking constantly until the mixture reaches 145 F (hot to the touch) on an instant read thermometer\nRemove the egg mixture from heat and place into the bowl of a stand mixture\nWhip the mixture on high speed until it cools in temperature, is light and billowing, and resembles marshmallow fluff.  Mixture should be room temperature before continuing\nWith the mixer on medium-high speed add the butter in small pieces a few tablespoons at a time, waiting until each portion is completely incorporated until adding the next.  Halfway through adding the butter, scrape down the sides of the bowl\nContinue to whip until all the butter has been added and the mixture is velvety and smooth.  Add cardamom, honey, and salt; whip to incorporate\n(Optional) Transfer buttercream to a piping bag with a medium round tip"
    }
  ]
}